

import React from "react";
import { useParams } from "react-router-dom";

// Detailed descriptions for lessons
const lessonDetails = {
  ["ክፍል 1 - መጽሐፍ ቅዱስ ታሪክ"]: 
      [        
     {subtitle: {
      titles: "መጽሐፍ ቅዱስ ስሙን ከየት አገኘ?",
      description: `
 በአማርኛ “መጽሐፍ ቅዱስ” በእንግሊዘኛ “Holy Bible” የሚለው ስያሜ ከግሪኩ “βιβλίον” (biblion) የመጣ ነው። ትርጉሙም “መጽሐፍ” ወይም ጥቅል ጽሑፍ ማለት ነው። ይህም ከፓፒረስ ተክል የተሠራ ወረቀት ላይ ሲጻፍ የተሰጠ ስያሜ ነው። 

 በሴፕቱአጅንት (Septuagint) ትርጉም ውስጥ እንደ ዳንኤል 9፡2 “በመጽሐፍ” በሚለው ቃል ፈንታ “βιβλία” ተጠቅመው ታይቷል። ከዚህ በኋላ የግሪክ ተናጋሪ ክርስቲያኖች የብሉይና የአዲስ ኪዳን መፃህፍትን “βιβλία” በማለት ጀመሩ። ይህም በእንግሊዝኛ “Bible” በአማርኛም “መጽሐፍ ቅዱስ” ብሎ እንዲታወቅ አድርጎታል። 

 በመጽሐፍ ቅዱስ ውስጥ ከ“βιβλία” በተጨማሪ “hai graphai” (ጽሑፎች) እና “ta-hiera grammata” (ቅዱሳን ጽሑፎች) የሚሉ ቃላትም ተጠቅሰዋል። 

 እንዲሁም መጽሐፍ ቅዱስ የተጻፈበት ቋንቋ በብሉይ ኪዳን ዕብራይስጥ፣ በአዲስ ኪዳን ግሪክኛ እና አንዳንድ ክፍሎች አረማይክ ነበር። ዳንኤል ከ2፡4–7፡28 እና እዝራ ከ4፡8–7፡26 አረማይክ ቋንቋ ላይ ተጻፉ። ይህም የመጽሐፍ ቅዱስ ቋንቋዊ ታሪክን በግልጽ ሁኔታ ያሳያል።
      `
    }
     
},
{subtitle: {
      titles: "የመጽሐፍ ቅዱስ ጽሁፎች በምን ላይ ነበር የተጻፉት?",
      description: `
 በጥንት ዘመን ጽሑፎች የሚፃፉት በድንጋይ፣ በሸክላ ጡቦች፣ ለመጻፊያ በተዘጋጀ ፓፒረስ፣ በተፋቁ የእንሰሳት ቆዳዎች ወይም ብራናዎች፣ በእንጨት፣ በዝሆን ጥርስ፣ በስብርባሪ ሸክላዎች፣ በብረት ዕቃዎች ላይ ነበር። በመጨረሻ በእኛ ዘመን በወረቀት ላይ ሆነ። የአፃፃፍ ሂደቱ ደግሞ አብዛኛው ሰው በጥቂቱም ቢሆን መፃፍ የሚችል ቢሆንም እንኳ አንዳንድ ደብዳቤዎች ወይም ጽሑፎች ግን የሚጻፉት ጥሩ መጻፍ በሚችሉ ፀሐፊዎች ነበር (በአገራችን የቁም ጸሃፊዎች የሚባሉትን ያስታውሷል)። አንዳንዶቹ መንደር ውስጥ የሚገኙ የግል ጸሐፊዎች ሲሆኑ ሌሎቹ ደግሞ በክፍያ የሚሰሩ ጸሐፊዎች ነበሩ። በሌላ አነጋገር አንዳንዶቹ አማተር ሲሆኑ ሌሎቹ ደግሞ በክፍያ የሚሰሩ ፕሮፌሽናል ፀሐፊዎች ነበሩ ማለት ነው። 


ጸሐፊዎቹ በፓፒረስ ላይ በሚጽፉበት ጊዜ በፖፒረሱ ላይ የሚገኙትን መስመሮች ለጽሑፎቻቸው በሚያመች መልኩ ወደ አግድሞሽ አዙረው ፓፒረሶቹ ላይ በሚገኘው ተፈጥሯዊ መስመር በመከተል ጽሑፎቻቸውን ሳያንጋድዱ ይጽፋሉ። በብራና ሲጠቀሙ ግን ቀለም ባልነካው ሹል ነገር ጽሑፎቻቸው እንዳይንጋደዱ የሚረዷቸውን አግድም መስመሮች ያሰምራሉ በተጨማሪም ሁለት ወይም ሦስት አምድና ኅዳግ (margin) ለመስራት የሚያመቹ መስመሮችን ጽሑፍ ከመጀመራቸው በፊት ያዘጋጃሉ።

ይህ በዚህ ሁኔታ ቀጥሎ ዘመን እየተለወጠ ሲመጣ፤ እነዚህ ከፓፒረስ ለመፃፊያነት የተዘጋጁ ቅጠሎች እርስ በርሳቸው ተደራርበውና ታጥፈው ሲሰፉ፤ ከጥቅሉ (scroll) በተሻለ እንደ ዘመናችን መጽሐፍ በሚመስል መልክ ተዘጋጅተው ቀረቡ። በተጨማሪ ከፓፒረስ ተክል ከተዘጋጁት ጥንታዊ የመጽሐፍ ጥቅሎች ይልቅ፤በተመሳሳይ መንገድ ከእንሰሳት ቆዳ ተፍቆ በሚሰራ ብራና ላይ መፃፍ አመቺ ሆኖ ተገኘ። ይህም አዲስ ግኝት በቀላሉ ከቦታ ቦታ ለማዘዋወርና ለረጅም ዘመን ለማገልገል ስለሚያስችል ተፈላጊ ሆነ። ስለዚህ ከፓፒረስና ከብራና የተዘጋጁት እነዚህ መጽሐፍት፤ በተለያዩ ሰዎች የተጻፉ ጽሑፎችን በአንድ ጥራዝ ለማድረግ በማስቻላቸው ተወዳጅነትን አተረፉ። ስማቸውም “የተጠረዘ የጥንት ጽሁፍ” “codex” በመባል ታወቀ፤ የመጻሕፍት አዘገጃጀትም ከጥቅልል ወደ ጥራዝ ተቀየረ። በተለይ ከብራና የሚዘጋጀው የጥራዝ ጽሁፍ (ኮዴክስ) አዲስ ግኝት በቀላሉ ጹሑፍን በፊትና በጀርባው ለመፃፍ ከማስቻሉም በተጨማሪ ረዘም ያሉ ጽሑፎችን ለመጻፍ ስላስቻለ ተመራጭ እየሆነ መጣ። በዚህ የጥራዝ አሠራር መነሻነትም የወረቀት ጽሁፍና ጥራዝ መነሻ በማግኘት እስከዘመናችን ድረስ በአገልግሎት ላይ የዋለ መገልገያ ለመሆን ችሏል።

ማስታወሻ፤ በዚህ በተከታታይ በምናወጣው ጽሁፍ የመጀመሪያ ክፍል በጥንት ጊዜ መልእክት እንዴት ይተላለፍ እንደነበር፣ መጽሐፍ ቅዱስ ስሙን ከየት እንዳገኘ፤ የተጻፈበት ዓላማ ምን እንደሆነ፤ የተጻፈበት ቋንቋ ምን እንደሆነና በምን ላይ እንደተጻፈ ጠቅለል ያለ ሃሳብ ለመዳሰስ ሞክረናል። በቀጣዩ ክፍሎች መጽሐፍ ቅዱስ ወደ እኛ ለሚያደርሰው መልዕክት የተጠቀመባቸውን አራት ተያያዥ ሒደቶችንና ሌሎች ጉዳዮችን እንመለከታለን። `
    }
     
}

],
 ["ክፍል 2 - መልእክቶች እና ትምህርቶች"]: 
      [        
     {subtitle: {
      titles: "መጽሐፍ ቅዱስ ስሙን ከየት አገኘ?",
      description: `
 በአማርኛ “መጽሐፍ ቅዱስ” በእንግሊዘኛ “Holy Bible” የሚለው ስያሜ ከግሪኩ “βιβλίον” (biblion) የመጣ ነው። ትርጉሙም “መጽሐፍ” ወይም ጥቅል ጽሑፍ ማለት ነው። ይህም ከፓፒረስ ተክል የተሠራ ወረቀት ላይ ሲጻፍ የተሰጠ ስያሜ ነው። 

 በሴፕቱአጅንት (Septuagint) ትርጉም ውስጥ እንደ ዳንኤል 9፡2 “በመጽሐፍ” በሚለው ቃል ፈንታ “βιβλία” ተጠቅመው ታይቷል። ከዚህ በኋላ የግሪክ ተናጋሪ ክርስቲያኖች የብሉይና የአዲስ ኪዳን መፃህፍትን “βιβλία” በማለት ጀመሩ። ይህም በእንግሊዝኛ “Bible” በአማርኛም “መጽሐፍ ቅዱስ” ብሎ እንዲታወቅ አድርጎታል። 

 በመጽሐፍ ቅዱስ ውስጥ ከ“βιβλία” በተጨማሪ “hai graphai” (ጽሑፎች) እና “ta-hiera grammata” (ቅዱሳን ጽሑፎች) የሚሉ ቃላትም ተጠቅሰዋል። 

 እንዲሁም መጽሐፍ ቅዱስ የተጻፈበት ቋንቋ በብሉይ ኪዳን ዕብራይስጥ፣ በአዲስ ኪዳን ግሪክኛ እና አንዳንድ ክፍሎች አረማይክ ነበር። ዳንኤል ከ2፡4–7፡28 እና እዝራ ከ4፡8–7፡26 አረማይክ ቋንቋ ላይ ተጻፉ። ይህም የመጽሐፍ ቅዱስ ቋንቋዊ ታሪክን በግልጽ ሁኔታ ያሳያል።
      `
    }
     
},
{subtitle: {
      titles: "የመጽሐፍ ቅዱስ ጽሁፎች በምን ላይ ነበር የተጻፉት?",
      description: `
 በጥንት ዘመን ጽሑፎች የሚፃፉት በድንጋይ፣ በሸክላ ጡቦች፣ ለመጻፊያ በተዘጋጀ ፓፒረስ፣ በተፋቁ የእንሰሳት ቆዳዎች ወይም ብራናዎች፣ በእንጨት፣ በዝሆን ጥርስ፣ በስብርባሪ ሸክላዎች፣ በብረት ዕቃዎች ላይ ነበር። በመጨረሻ በእኛ ዘመን በወረቀት ላይ ሆነ። የአፃፃፍ ሂደቱ ደግሞ አብዛኛው ሰው በጥቂቱም ቢሆን መፃፍ የሚችል ቢሆንም እንኳ አንዳንድ ደብዳቤዎች ወይም ጽሑፎች ግን የሚጻፉት ጥሩ መጻፍ በሚችሉ ፀሐፊዎች ነበር (በአገራችን የቁም ጸሃፊዎች የሚባሉትን ያስታውሷል)። አንዳንዶቹ መንደር ውስጥ የሚገኙ የግል ጸሐፊዎች ሲሆኑ ሌሎቹ ደግሞ በክፍያ የሚሰሩ ጸሐፊዎች ነበሩ። በሌላ አነጋገር አንዳንዶቹ አማተር ሲሆኑ ሌሎቹ ደግሞ በክፍያ የሚሰሩ ፕሮፌሽናል ፀሐፊዎች ነበሩ ማለት ነው። 


ጸሐፊዎቹ በፓፒረስ ላይ በሚጽፉበት ጊዜ በፖፒረሱ ላይ የሚገኙትን መስመሮች ለጽሑፎቻቸው በሚያመች መልኩ ወደ አግድሞሽ አዙረው ፓፒረሶቹ ላይ በሚገኘው ተፈጥሯዊ መስመር በመከተል ጽሑፎቻቸውን ሳያንጋድዱ ይጽፋሉ። በብራና ሲጠቀሙ ግን ቀለም ባልነካው ሹል ነገር ጽሑፎቻቸው እንዳይንጋደዱ የሚረዷቸውን አግድም መስመሮች ያሰምራሉ በተጨማሪም ሁለት ወይም ሦስት አምድና ኅዳግ (margin) ለመስራት የሚያመቹ መስመሮችን ጽሑፍ ከመጀመራቸው በፊት ያዘጋጃሉ።

ይህ በዚህ ሁኔታ ቀጥሎ ዘመን እየተለወጠ ሲመጣ፤ እነዚህ ከፓፒረስ ለመፃፊያነት የተዘጋጁ ቅጠሎች እርስ በርሳቸው ተደራርበውና ታጥፈው ሲሰፉ፤ ከጥቅሉ (scroll) በተሻለ እንደ ዘመናችን መጽሐፍ በሚመስል መልክ ተዘጋጅተው ቀረቡ። በተጨማሪ ከፓፒረስ ተክል ከተዘጋጁት ጥንታዊ የመጽሐፍ ጥቅሎች ይልቅ፤በተመሳሳይ መንገድ ከእንሰሳት ቆዳ ተፍቆ በሚሰራ ብራና ላይ መፃፍ አመቺ ሆኖ ተገኘ። ይህም አዲስ ግኝት በቀላሉ ከቦታ ቦታ ለማዘዋወርና ለረጅም ዘመን ለማገልገል ስለሚያስችል ተፈላጊ ሆነ። ስለዚህ ከፓፒረስና ከብራና የተዘጋጁት እነዚህ መጽሐፍት፤ በተለያዩ ሰዎች የተጻፉ ጽሑፎችን በአንድ ጥራዝ ለማድረግ በማስቻላቸው ተወዳጅነትን አተረፉ። ስማቸውም “የተጠረዘ የጥንት ጽሁፍ” “codex” በመባል ታወቀ፤ የመጻሕፍት አዘገጃጀትም ከጥቅልል ወደ ጥራዝ ተቀየረ። በተለይ ከብራና የሚዘጋጀው የጥራዝ ጽሁፍ (ኮዴክስ) አዲስ ግኝት በቀላሉ ጹሑፍን በፊትና በጀርባው ለመፃፍ ከማስቻሉም በተጨማሪ ረዘም ያሉ ጽሑፎችን ለመጻፍ ስላስቻለ ተመራጭ እየሆነ መጣ። በዚህ የጥራዝ አሠራር መነሻነትም የወረቀት ጽሁፍና ጥራዝ መነሻ በማግኘት እስከዘመናችን ድረስ በአገልግሎት ላይ የዋለ መገልገያ ለመሆን ችሏል።

ማስታወሻ፤ በዚህ በተከታታይ በምናወጣው ጽሁፍ የመጀመሪያ ክፍል በጥንት ጊዜ መልእክት እንዴት ይተላለፍ እንደነበር፣ መጽሐፍ ቅዱስ ስሙን ከየት እንዳገኘ፤ የተጻፈበት ዓላማ ምን እንደሆነ፤ የተጻፈበት ቋንቋ ምን እንደሆነና በምን ላይ እንደተጻፈ ጠቅለል ያለ ሃሳብ ለመዳሰስ ሞክረናል። በቀጣዩ ክፍሎች መጽሐፍ ቅዱስ ወደ እኛ ለሚያደርሰው መልዕክት የተጠቀመባቸውን አራት ተያያዥ ሒደቶችንና ሌሎች ጉዳዮችን እንመለከታለን። `
    }
     
}

],
  ["ከመጀመሪያው ዘመን እስከ ዛሬ"]: 
      [        
     {subtitle: {
      titles: "መጽሐፍ ቅዱስ ስሙን ከየት አገኘ?",
      description: `
 በአማርኛ “መጽሐፍ ቅዱስ” በእንግሊዘኛ “Holy Bible” የሚለው ስያሜ ከግሪኩ “βιβλίον” (biblion) የመጣ ነው። ትርጉሙም “መጽሐፍ” ወይም ጥቅል ጽሑፍ ማለት ነው። ይህም ከፓፒረስ ተክል የተሠራ ወረቀት ላይ ሲጻፍ የተሰጠ ስያሜ ነው። 

 በሴፕቱአጅንት (Septuagint) ትርጉም ውስጥ እንደ ዳንኤል 9፡2 “በመጽሐፍ” በሚለው ቃል ፈንታ “βιβλία” ተጠቅመው ታይቷል። ከዚህ በኋላ የግሪክ ተናጋሪ ክርስቲያኖች የብሉይና የአዲስ ኪዳን መፃህፍትን “βιβλία” በማለት ጀመሩ። ይህም በእንግሊዝኛ “Bible” በአማርኛም “መጽሐፍ ቅዱስ” ብሎ እንዲታወቅ አድርጎታል። 

 በመጽሐፍ ቅዱስ ውስጥ ከ“βιβλία” በተጨማሪ “hai graphai” (ጽሑፎች) እና “ta-hiera grammata” (ቅዱሳን ጽሑፎች) የሚሉ ቃላትም ተጠቅሰዋል። 

 እንዲሁም መጽሐፍ ቅዱስ የተጻፈበት ቋንቋ በብሉይ ኪዳን ዕብራይስጥ፣ በአዲስ ኪዳን ግሪክኛ እና አንዳንድ ክፍሎች አረማይክ ነበር። ዳንኤል ከ2፡4–7፡28 እና እዝራ ከ4፡8–7፡26 አረማይክ ቋንቋ ላይ ተጻፉ። ይህም የመጽሐፍ ቅዱስ ቋንቋዊ ታሪክን በግልጽ ሁኔታ ያሳያል።
      `
    }
     
},
{subtitle: {
      titles: "የመጽሐፍ ቅዱስ ጽሁፎች በምን ላይ ነበር የተጻፉት?",
      description: `
 በጥንት ዘመን ጽሑፎች የሚፃፉት በድንጋይ፣ በሸክላ ጡቦች፣ ለመጻፊያ በተዘጋጀ ፓፒረስ፣ በተፋቁ የእንሰሳት ቆዳዎች ወይም ብራናዎች፣ በእንጨት፣ በዝሆን ጥርስ፣ በስብርባሪ ሸክላዎች፣ በብረት ዕቃዎች ላይ ነበር። በመጨረሻ በእኛ ዘመን በወረቀት ላይ ሆነ። የአፃፃፍ ሂደቱ ደግሞ አብዛኛው ሰው በጥቂቱም ቢሆን መፃፍ የሚችል ቢሆንም እንኳ አንዳንድ ደብዳቤዎች ወይም ጽሑፎች ግን የሚጻፉት ጥሩ መጻፍ በሚችሉ ፀሐፊዎች ነበር (በአገራችን የቁም ጸሃፊዎች የሚባሉትን ያስታውሷል)። አንዳንዶቹ መንደር ውስጥ የሚገኙ የግል ጸሐፊዎች ሲሆኑ ሌሎቹ ደግሞ በክፍያ የሚሰሩ ጸሐፊዎች ነበሩ። በሌላ አነጋገር አንዳንዶቹ አማተር ሲሆኑ ሌሎቹ ደግሞ በክፍያ የሚሰሩ ፕሮፌሽናል ፀሐፊዎች ነበሩ ማለት ነው። 


ጸሐፊዎቹ በፓፒረስ ላይ በሚጽፉበት ጊዜ በፖፒረሱ ላይ የሚገኙትን መስመሮች ለጽሑፎቻቸው በሚያመች መልኩ ወደ አግድሞሽ አዙረው ፓፒረሶቹ ላይ በሚገኘው ተፈጥሯዊ መስመር በመከተል ጽሑፎቻቸውን ሳያንጋድዱ ይጽፋሉ። በብራና ሲጠቀሙ ግን ቀለም ባልነካው ሹል ነገር ጽሑፎቻቸው እንዳይንጋደዱ የሚረዷቸውን አግድም መስመሮች ያሰምራሉ በተጨማሪም ሁለት ወይም ሦስት አምድና ኅዳግ (margin) ለመስራት የሚያመቹ መስመሮችን ጽሑፍ ከመጀመራቸው በፊት ያዘጋጃሉ።

ይህ በዚህ ሁኔታ ቀጥሎ ዘመን እየተለወጠ ሲመጣ፤ እነዚህ ከፓፒረስ ለመፃፊያነት የተዘጋጁ ቅጠሎች እርስ በርሳቸው ተደራርበውና ታጥፈው ሲሰፉ፤ ከጥቅሉ (scroll) በተሻለ እንደ ዘመናችን መጽሐፍ በሚመስል መልክ ተዘጋጅተው ቀረቡ። በተጨማሪ ከፓፒረስ ተክል ከተዘጋጁት ጥንታዊ የመጽሐፍ ጥቅሎች ይልቅ፤በተመሳሳይ መንገድ ከእንሰሳት ቆዳ ተፍቆ በሚሰራ ብራና ላይ መፃፍ አመቺ ሆኖ ተገኘ። ይህም አዲስ ግኝት በቀላሉ ከቦታ ቦታ ለማዘዋወርና ለረጅም ዘመን ለማገልገል ስለሚያስችል ተፈላጊ ሆነ። ስለዚህ ከፓፒረስና ከብራና የተዘጋጁት እነዚህ መጽሐፍት፤ በተለያዩ ሰዎች የተጻፉ ጽሑፎችን በአንድ ጥራዝ ለማድረግ በማስቻላቸው ተወዳጅነትን አተረፉ። ስማቸውም “የተጠረዘ የጥንት ጽሁፍ” “codex” በመባል ታወቀ፤ የመጻሕፍት አዘገጃጀትም ከጥቅልል ወደ ጥራዝ ተቀየረ። በተለይ ከብራና የሚዘጋጀው የጥራዝ ጽሁፍ (ኮዴክስ) አዲስ ግኝት በቀላሉ ጹሑፍን በፊትና በጀርባው ለመፃፍ ከማስቻሉም በተጨማሪ ረዘም ያሉ ጽሑፎችን ለመጻፍ ስላስቻለ ተመራጭ እየሆነ መጣ። በዚህ የጥራዝ አሠራር መነሻነትም የወረቀት ጽሁፍና ጥራዝ መነሻ በማግኘት እስከዘመናችን ድረስ በአገልግሎት ላይ የዋለ መገልገያ ለመሆን ችሏል።

ማስታወሻ፤ በዚህ በተከታታይ በምናወጣው ጽሁፍ የመጀመሪያ ክፍል በጥንት ጊዜ መልእክት እንዴት ይተላለፍ እንደነበር፣ መጽሐፍ ቅዱስ ስሙን ከየት እንዳገኘ፤ የተጻፈበት ዓላማ ምን እንደሆነ፤ የተጻፈበት ቋንቋ ምን እንደሆነና በምን ላይ እንደተጻፈ ጠቅለል ያለ ሃሳብ ለመዳሰስ ሞክረናል። በቀጣዩ ክፍሎች መጽሐፍ ቅዱስ ወደ እኛ ለሚያደርሰው መልዕክት የተጠቀመባቸውን አራት ተያያዥ ሒደቶችንና ሌሎች ጉዳዮችን እንመለከታለን። `
    }
     
}

]
}  
  



export default function LessonDetail() {
  const { lessonSlug } = useParams();
  const lesson = lessonDetails[lessonSlug];
 console.log(lesson)
  if (!lesson) {
    return <p className="text-center text-danger my-5">መረጃ አልተገኘም</p>;
  }

  return (
    <section className="container my-5" style={{padding:"100px 0"}}>
        <h1>  {lessonSlug}  </h1>
     {lesson.length > 0 ? (
             <ul className="list-group shadow-sm">
               {lesson.map((item, index) => (
                 <li key={index} className="list-group-item">
                 
                 <h2> {item.subtitle.titles}</h2><br/>   
                  <p>{item.subtitle.description}</p>      
                 </li>
                 
                 
               ))}
             </ul>
           ) : (
             <p className="text-center text-muted">መረጃ አልተገኘም</p>
           )}
    </section>
  );
}
